package com.example;

public class HowManyNegative {
    
    // פונקציה שסופרת את מספר המספרים השליליים במטריצה דו-ממדית
    public static int HowManyNegative(int[][] arr) {
        int i = 0; // מתחיל מהשורה הראשונה במטריצה
        int j = arr[i].length - 1; // מתחיל מהעמודה האחרונה של השורה הראשונה
        int count = 0; // אתחול מונה שיספור את מספר המספרים השליליים

        // לולאה שרצה כל עוד אנחנו בתוך גבולות המטריצה
        while (i < arr.length && j > -1) {
            // בדיקה אם המספר בעמדה [i][j] שלילי
            if (arr[i][j] < 0) {
                // אם המספר שלילי, כל המספרים משמאלו באותה השורה גם הם שליליים
                count += j + 1; //ספירת עמודות  מוסיפים את כל העמודות מהעמודה הנוכחית עד העמודה הראשונה למונה
                i++; // עוברים לשורה הבאה
            } else {
                // אם המספר בעמדה [i][j] אינו שלילי, עוברים לעמודה הקודמת באותה שורה
                j--;
            }
        }

        // מחזירים את מספר המספרים השליליים שנמצאו במטריצה
        return count;
    }

    // פונקציית main להרצת הקוד ובדיקת הפונקציה
    public static void main(String[] args) {
        // הגדרת מטריצה דו-ממדית לדוגמה
        int[][] arr = {
            {-3, -2, -1, 1},
            {-2, 2, 3, 4},
            {4, 5, 7, 8}
        };

        // הדפסת מספר המספרים השליליים במטריצה בעזרת הפונקציה
        System.out.println("Number of negative numbers: " + HowManyNegative(arr));
    }
}
